backend/app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    if current_user.has_role? :admin
      @products = Product.all

INSERT INTO "products" ("name", "description", "characteristic", "mark", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["description", ""], ["characteristic", ""], ["mark", ""], ["created_at", "2021-09-22 17:31:11.796246"], ["updated_at", "2021-09-22 17:31:11.796246"]]
---
  def create
    @product = Product.new(product_params)
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "products" SET "name" = ?, "characteristic" = ?, "mark" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "sueter1"], ["characteristic", ""], ["mark", ""], ["updated_at", "2021-09-20 05:16:33.883769"], ["id", 1]]
---
  def update
    @product = Product.find(params[:id])
      if @product.update(product_params)