backend/app/controllers/suppliers_controller.rb

INSERT INTO "suppliers" ("name", "email", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["email", ""], ["address", ""], ["created_at", "2021-09-22 23:10:26.054138"], ["updated_at", "2021-09-22 23:10:26.054138"]]
---
  def create
    @supplier = Supplier.new(supplier_params)
    if @supplier.save

SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @supplier = Supplier.find(params[:id])

SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "suppliers" SET "name" = ?, "telephone" = ?, "address" = ?, "updated_at" = ? WHERE "suppliers"."id" = ?  [["name", "David Cabrera"], ["telephone", 3002666862], ["address", "carrera 10 #8d-66"], ["updated_at", "2021-09-22 20:38:30.632832"], ["id", 1]]
---
  def update
    @supplier = Supplier.find(params[:id])
      if @supplier.update(supplier_params)

SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "suppliers" WHERE "suppliers"."id" = ?  [["id", 1]]
---
  def destroy
    @supplier = Supplier.find(params[:id])
    @supplier.destroy